Tekla Open API Reference for Tekla Structures 2025
TeklaStructuresVariables Methods
The TeklaStructuresVariables type exposes the following members.
Methods
Name | Description
Add
 Adds a variable to the list.
ContainsVariable
 Gets a key.
Get
 Gets a key.
Top
See Also
Reference
TeklaStructuresVariables Class
Tekla.Structures Namespace